# GetAssociatedElementIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalToPhysicalAssociationManager..::..GetAssociatedElementIds Method
AnalyticalToPhysicalAssociationManager Class See Also
---
Returns ids of the elements which are in association with the element with the given ElementId.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ISet<ElementId> GetAssociatedElementIds(
	ElementId elementId
)
```

Visual Basic
---
```text
Public Function GetAssociatedElementIds ( _
	elementId As ElementId _
) As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetAssociatedElementIds(
	ElementId^ elementId
)
```

# ### Parameters
elementId
    Type: Autodesk.Revit.DB..::..ElementId Element id for which we want to get the associated elements.
# ### Return Value
Ids of the associated elements.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalyticalToPhysicalAssociationManager Class
Autodesk.Revit.DB.Structure Namespace